Repository: microbitvn/help.microbit.vn
Catalog: docs/lancaster-mbed/advanced_*.po
Languages: vi

source: Here's a `config.json`, using all available configuration options, that matches the default values specified in `MicroBitConfig.h`:
vi: Dưới đây là một `config.json`, sử dụng tất cả các tùy chọn cấu hình có sẵn, phù hợp với các giá trị mặc định được quy định trong `MicroBitConfig.h`:

source: It should be noted that **all** of the above options are optional, and will revert to their default values if not specified. This means that we can also provide a subset of these options, to configure specific parts of the runtime:
vi: Cần lưu ý rằng **tất cả** các tùy chọn ở trên là tùy chọn, và sẽ trở lại giá trị mặc định của chúng nếu không được nhắc đến. Điều này có nghĩa rằng chúng ta cũng có thể cung cấp một tập hợp con của các tùy chọn này, để cấu hình các phần cụ thể của bộ runtime:

source: Additionally, the options provided through `config.json` intuitively map onto the `#defines` listed in `MicroBitConfig.h`
vi: Ngoài ra, các tùy chọn được cung cấp qua `config.json` ánh xạ một cách tự nhiên lên `#defines` listed in `MicroBitConfig.h`

source: An example of `config.json` in operation is available at the [microbit-samples](https://github.com/lancaster-university/microbit-samples) GitHub repository.
vi: Một ví dụ của `config.json` khi hoạt động có tại kho GitHub [microbit-samples](https://github.com/lancaster-university/microbit-samples).
