Repository: microbitvn/help.microbit.vn
Catalog: lancaster-mbed/offline-toolchains_*.po
Languages: vi

source: The micro:bit DAL is built on top of [ARM mbed](http://mbed.com) and hence uses [yotta](http://yotta.mbed.com) as an offline build system.
vi: Phần mềm micro:bit DAL được xây dựng dựa trên [ARM mbed](http://mbed.com) nên sử dụng [yotta](http://yotta.mbed.com) làm hệ thống xây dựng chương trình offline.

source: When using `yotta` to build micro:bit projects there are currently two supported toolchains:
vi: Khi sử dụng `yotta` để xây dựng dự án cho micro:bit, hiện nay có hai bộ công cụ (toolchain) hỗ trợ:

source: ## Installation on Windows
vi: ## Cài đặt trên Windows

# offline-toolchains.md:12
source: ### Install yotta and dependencies
vi: ### Cài đặt yotta và các gói phụ thuộc

# offline-toolchains.md:14
source: The first step is to get `yotta` and its dependencies onto your machine, to do this follow the install guide [here](http://docs.yottabuild.org/#installing).
vi: Bước đầu tiên là lấy `yotta` và các gói phụ thuộc về máy của bạn, để làm việc này bạn hãy làm theo hướng dẫn cài đặt [ở đây](http://docs/yottabuild.org/#installing).

source: For the micro:bit targets you currently still need the `srecord` tools, which can be installed on **Windows** from [sourceforge](http://srecord.sourceforge.net/).
vi: Để dùng micro:bit làm thiết bị đích, bạn còn cần thêm công cụ `srecord`, có thể cài đặt được trên **Windows** từ [sourceforge](http://srecord.sourceforge.net/).

# offline-toolchains.md:19
source: `srecord` is used to create the final binaries for the micro:bit so is an essential dependency.
vi: `srecord` được dùng để tạo ra chương trình cuối cùng chạy được cho micro:bit nên nó là một gói phụ thuộc cơ bản.

# offline-toolchains.md:22
source: ### Fetch the example project
vi: ### Lấy về dự án mẫu

# offline-toolchains.md:29
source: ### Set your yotta target
vi: ### Chọn thiết bị đích cho yotta

# offline-toolchains.md:31
source: A `yotta` target contains the information required by `yotta` in order to build a project for a specific combination of hardware. This includes the type of compiler. The microbit projects can build with both `armcc` and `gcc`, but as it gets installed with the `yotta` installer, we'll use `gcc` by default and choose a micro:bit specific target that knows about the hardware on the board.
vi: Một cái đích (target) cho `yotta` bao gồm thông tin mà `yotta` cần để xây dựng một dự án từ một bộ phần cứng cụ thể. Thông tin này cũng gồm loại trình biên dịch. Các dự án micro:bit có thể được biên dịch với cả `armcc` lẫn `gcc`, nhưng do `gcc` được cài đặt sẵn với chương trình cài đặt `yotta` nên chúng ta sẽ dùng `gcc` làm mặc định và chọn một cái đích cụ thể là micro:bit có các thông tin về phần cứng trên bo mạch.

# offline-toolchains.md:33
source: You can use either `yotta` or `yt`, which is far easier to type!
vi: Bạn có thể dùng hoặc `yotta` hoặc `yt`, để gõ dễ hơn!

# offline-toolchains.md:39
source: !!! note In microbit-samples this target will be configured by default.
vi: !!! note "Lưu ý" Trong microbit-samples cái đích này (micro:bit) được chỉnh mặc định.

# offline-toolchains.md:42
source: You only need to set the target once per project. All future `yotta` commands will use this target information (for example, when resolving dependencies).
vi: Bạn chỉ cần cài đặt thiết bị đích (target) một lần cho mỗi dự án. Tất cả các lệnh `yotta` sau đó sẽ sử dụng thông tin của đích này (ví dụ, khi tìm kiếm các gói phụ thuộc).

# offline-toolchains.md:44
source: #### Build the project
vi: #### Biên dịch dự án

# offline-toolchains.md:50
source: ### Flash your micro:bit
vi: ### Ghi lên bo micro:bit của bạn

# offline-toolchains.md:52
source: The final step is to check your hex works.
vi: Bước cuối cùng là kiểm tra xem chương trình hex của bạn có chạy không.

source: The `yt build` command will place files in `/build/<TARGET_NAME>/source`. The file you will need to flash will be microbit-combined.hex. Simply drag and drop the hex onto the MICROBIT usb device.
vi: Lệnh `yt build` sẽ đặt các tập tin trong `/build/<TÊN_THIẾT_BỊ_ĐÍCH>/source`. Tập tin bạn cần để ghi vào bo mạch là `microbit-combined.hex`. Chỉ cần kéo và thả tập tin hex vào ổ đĩa USB MICROBIT.

source: In the case of our example, using `bbc-microbit-classic-gcc` we could flash the micro:bit (assuming it is plugged in and mounted at `E:`) as follows:
vi: Trong trường hợp ví dụ này, sử dụng `bbc-microbit-classic-gcc` chúng ta có thể ghi vào micro:bit (giả sử nó đã được gắn vào máy tính và là ổ đĩa `E:`) như sau:

source: ``` copy build\bbc-microbit-classic-gcc\source\microbit-samples-combined.hex E: ``` The expected result will be that the micro:bit will scroll `HELLO WORLD! :)` on its display.
vi: ``` copy build\bbc-microbit-classic-gcc\source\microbit-samples-combined.hex E: ``` Kết quả mong đợi là bo micro:bit sẽ chạy ngang dòng chữ `HELLO WORLD! :)` trên màn hình của nó.

source: ## Installation on Mac OSX
vi: ## Cài đặt trên Mac OSX

# offline-toolchains.md:67
source: ### Install yotta and dependencies
vi: ### Cài đặt yotta và các gói phụ thuộc

# offline-toolchains.md:69
source: The first step is to get `yotta` and its dependencies onto your machine, to do this follow the install guide [here](http://docs.yottabuild.org/#installing).
vi: Bước đầu tiên là lấy `yotta` và các gói phụ thuộc về máy của bạn, để làm việc này bạn hãy làm theo hướng dẫn cài đặt [ở đây](http://docs/yottabuild.org/#installing).

source: For the micro:bit targets you currently still need the `srecord` tools, which can be installed on **Mac OSX** using [brew](http://brew.sh/):
vi: Để dùng micro:bit làm thiết bị đích, bạn còn cần thêm công cụ `srecord`, có thể cài đặt được trên ** Mac OSX ** sử dụng [brew](http://brew.sh/):

# offline-toolchains.md:79
source: You can also install it manually from [sourceforge](http://srecord.sourceforge.net/).
vi: Bạn cũng có thể cài đặt nó bằng tay từ [sourceforge](http://srecord.sourceforge.net/).

# offline-toolchains.md:81
source: `srecord` is used to create the final binaries for the micro:bit so is an essential dependency.
vi: `srecord` được dùng để tạo ra chương trình cuối cùng chạy được cho micro:bit nên nó là một gói phụ thuộc cơ bản.

# offline-toolchains.md:83
source: ### Fetch the example project
vi: ### Lấy về dự án mẫu

# offline-toolchains.md:90
source: ### Set your yotta target
vi: ### Chọn thiết bị đích cho yotta

# offline-toolchains.md:92
source: A `yotta` target contains the information required by `yotta` in order to build a project for a specific combination of hardware. This includes the type of compiler. The microbit projects can build with both `armcc` and `gcc`, but as it gets installed with the `yotta` installer, we'll use `gcc` by default and choose a micro:bit specific target that knows about the hardware on the board.
vi: Một cái đích (target) cho `yotta` bao gồm thông tin mà `yotta` cần để xây dựng một dự án từ một bộ phần cứng cụ thể. Thông tin này cũng gồm loại trình biên dịch. Các dự án micro:bit có thể được biên dịch với cả `armcc` lẫn `gcc`, nhưng do `gcc` được cài đặt sẵn với chương trình cài đặt `yotta` nên chúng ta sẽ dùng `gcc` làm mặc định và chọn một cái đích cụ thể là micro:bit có các thông tin về phần cứng trên bo mạch.

# offline-toolchains.md:94
source: You can use either `yotta` or `yt`, which is far easier to type!
vi: Bạn có thể dùng hoặc `yotta` hoặc `yt`, để gõ dễ hơn!

# offline-toolchains.md:100
source: !!! note In microbit-samples this target will be configured by default.
vi: !!! note "Lưu ý" Trong microbit-samples cái đích này (micro:bit) được chỉnh mặc định.

# offline-toolchains.md:103
source: You only need to set the target once per project. All future `yotta` commands will use this target information (for example, when resolving dependencies).
vi: Bạn chỉ cần cài đặt thiết bị đích (target) một lần cho mỗi dự án. Tất cả các lệnh `yotta` sau đó sẽ sử dụng thông tin của đích này (ví dụ, khi tìm kiếm các gói phụ thuộc).

# offline-toolchains.md:105
source: #### Build the project
vi: #### Biên dịch dự án

# offline-toolchains.md:111
source: ### Flash your micro:bit
vi: ### Ghi lên bo micro:bit của bạn

# offline-toolchains.md:113
source: The final step is to check your hex works.
vi: Bước cuối cùng là kiểm tra xem chương trình hex của bạn có chạy không.

# offline-toolchains.md:115
source: The `yt build` command will place files in `/build/<TARGET_NAME>/source`. The file you will need to flash will be `microbit-samples-combined.hex`. Simply drag and drop the hex onto the MICROBIT usb device.
vi: Lệnh `yt build` sẽ đặt các tập tin trong `/build/<TÊN_THIẾT_BỊ_ĐÍCH>/source`. Tập tin bạn cần để ghi vào bo mạch là `microbit-combined.hex`. Chỉ cần kéo và thả tập tin hex vào ổ đĩa USB MICROBIT.

source: In the case of our example, using `bbc-microbit-classic-gcc` we could flash the micro:bit (assuming it is plugged in and mounted at `/Volumes/"MICROBIT"`) as follows:
vi: Trong trường hợp ví dụ này, sử dụng `bbc-microbit-classic-gcc` chúng ta có thể ghi vào micro:bit (giả sử nó đã được gắn vào máy tính ở đường dẫn `/Volumes/"MICROBIT"`) như sau:

source: The expected result will be that the micro:bit will scroll `HELLO WORLD! :)` on its display.
vi: Kết quả mong đợi là bo micro:bit sẽ chạy ngang dòng chữ `HELLO WORLD! :)` trên màn hình của nó.

# offline-toolchains.md:125
source: !!!note Note that if you'd like to copy the file from the command line, you can use the following command in any `yotta` project to do so, though it assumes you have only one micro:bit plugged in:
vi: !!! note "Lưu ý" Lưu ý rằng nếu bạn muốn sao chép các tập tin từ dòng lệnh, bạn có thể sử dụng lệnh sau đây trong bất kỳ dự án 'yotta` nào, với điều kiện bạn cắm vào máy chỉ một bo micro:bit:

source: ## Installation on Linux
vi: ## Cài đặt trên Linux

# offline-toolchains.md:137
source: ### Install yotta and dependencies
vi: ### Cài đặt yotta và các gói phụ thuộc

# offline-toolchains.md:139
source: The first step is to get `yotta` and its dependencies onto your machine, to do this follow the install guide [here](http://docs.yottabuild.org/#installing).
vi: Bước đầu tiên là lấy `yotta` và các gói phụ thuộc về máy của bạn, để làm việc này bạn hãy làm theo hướng dẫn cài đặt [ở đây](http://docs/yottabuild.org/#installing).

source: For the micro:bit targets you currently still need the `srecord` tools, which can be installed on **Ubuntu** using
vi: Để dùng micro:bit làm thiết bị đích, bạn còn cần thêm công cụ `srecord`, có thể cài đặt được trên **Ubuntu** sử dụng:

# offline-toolchains.md:148
source: You can also install it manually from [sourceforge](http://srecord.sourceforge.net/).
vi: Bạn cũng có thể cài đặt nó bằng tay từ [sourceforge](http://srecord.sourceforge.net/).

# offline-toolchains.md:150
source: `srecord` is used to create the final binaries for the micro:bit so is an essential dependency.
vi: `srecord` được dùng để tạo ra chương trình cuối cùng chạy được cho micro:bit nên nó là một gói phụ thuộc cơ bản.

# offline-toolchains.md:153
source: ### Fetch the example project
vi: ### Lấy về dự án mẫu

# offline-toolchains.md:160
source: ### Set your yotta target
vi: ### Chọn thiết bị đích cho yotta

# offline-toolchains.md:162
source: A `yotta` target contains the information required by `yotta` in order to build a project for a specific combination of hardware. This includes the type of compiler. The microbit projects can build with both `armcc` and `gcc`, but as it gets installed with the `yotta` installer, we'll use `gcc` by default and choose a micro:bit specific target that knows about the hardware on the board.
vi: Một cái đích (target) cho `yotta` bao gồm thông tin mà `yotta` cần để xây dựng một dự án từ một bộ phần cứng cụ thể. Thông tin này cũng gồm loại trình biên dịch. Các dự án micro:bit có thể được biên dịch với cả `armcc` lẫn `gcc`, nhưng do `gcc` được cài đặt sẵn với chương trình cài đặt `yotta` nên chúng ta sẽ dùng `gcc` làm mặc định và chọn một cái đích cụ thể là micro:bit có các thông tin về phần cứng trên bo mạch.

# offline-toolchains.md:164
source: You can use either `yotta` or `yt`, which is far easier to type!
vi: Bạn có thể dùng hoặc `yotta` hoặc `yt`, để gõ dễ hơn!

# offline-toolchains.md:170
source: !!! note In microbit-samples this target will be configured by default.
vi: !!! note "Lưu ý" Trong microbit-samples cái đích này (micro:bit) được chỉnh mặc định.

# offline-toolchains.md:173
source: You only need to set the target once per project. All future `yotta` commands will use this target information (for example, when resolving dependencies).
vi: Bạn chỉ cần cài đặt thiết bị đích (target) một lần cho mỗi dự án. Tất cả các lệnh `yotta` sau đó sẽ sử dụng thông tin của đích này (ví dụ, khi tìm kiếm các gói phụ thuộc).

# offline-toolchains.md:175
source: #### Build the project
vi: #### Biên dịch dự án

# offline-toolchains.md:181
source: ### Flash your micro:bit
vi: ### Ghi lên bo micro:bit của bạn

# offline-toolchains.md:183
source: The final step is to check your hex works.
vi: Bước cuối cùng là kiểm tra xem chương trình hex của bạn có chạy không.

# offline-toolchains.md:185
source: The `yt build` command will place files in `/build/<TARGET_NAME>/source`. The file you will need to flash will be `microbit-samples-combined.hex`. Simply drag and drop the hex onto the MICROBIT usb device.
vi: Lệnh `yt build` sẽ đặt các tập tin trong `/build/<TÊN_THIẾT_BỊ_ĐÍCH>/source`. Tập tin bạn cần để ghi vào bo mạch là `microbit-combined.hex`. Chỉ cần kéo và thả tập tin hex vào ổ đĩa USB MICROBIT.

source: In the case of our example, using `bbc-microbit-classic-gcc` we could flash the micro:bit (assuming it is plugged in and mounted at `/media/MICROBIT`) as follows:
vi: Trong trường hợp ví dụ này, sử dụng `bbc-microbit-classic-gcc` chúng ta có thể ghi vào micro:bit (giả sử nó đã được gắn vào máy tính ở đường dẫn `/media/MICROBIT`) như sau:

source: ``` cp ./build/bbc-microbit-classic-gcc/source/microbit-samples-combined.hex /media/MICROBIT ``` The expected result will be that the micro:bit will scroll `HELLO WORLD! :)` on its display.
vi: ``` cp ./build/bbc-microbit-classic-gcc/source/microbit-samples-combined.hex /media/MICROBIT ``` Kết quả mong đợi là bo micro:bit sẽ chạy ngang dòng chữ `HELLO WORLD! :)` trên màn hình của nó.

# offline-toolchains.md:194
source: !!!note Note that if you'd like to copy the file from the command line, you can use the following command in any `yotta` project to do so, though it assumes you have only one micro:bit plugged in:
vi: !!! note "Lưu ý" Lưu ý rằng nếu bạn muốn sao chép các tập tin từ dòng lệnh, bạn có thể sử dụng lệnh sau đây trong bất kỳ dự án 'yotta` nào, với điều kiện bạn cắm vào máy chỉ một bo micro:bit:
