Repository: microbitvn/help.microbit.vn
Catalog: lancaster-mbed/online-toolchains_*.po
Languages: vi

source: #Web-based C/C++ environments supporting the runtime
vi: #Môi trường lập trình C/C++ trên web có hỗ trợ bộ runtime

source: | Online compiler | Description | | --- |-------------| | [![ARM mbed](resources/logos/mbed.png)](#mbed) | ARM mbed has an online IDE for C/C++ development available at [http://developer.mbed.org](http://developer.mbed.org). It is free to use and the BBC micro:bit is one of its officially supported platforms. This online IDE provides a simple interface for writing, compiling and sharing projects like the micro:bit DAL, which is based on the [mbed SDK](https://github.com/mbedmicro/mbed). |
vi: | Trình biên dịch online | Mô tả | | --- |-------------| | [![ARM mbed](resources/logos/mbed.png)](#mbed) | ARM mbed có một môi trường phát triển tích hợp (IDE) online để phát triển code với C/C++ tại địa chỉ [http://developer.mbed.org](http://developer.mbed.org). Nó cho phép dùng miễn phí và bo BBC micro:bit là một trong các nền tảng được hỗ trợ chính thức. Trình online IDE này cung cấp một giao diện đơn giản để viết, biên dịch và chia sẻ các dự án kiểu như micro:bit DAL, dựa trên bộ phát triển [mbed SDK](https://github.com/mbedmicro/mbed). |

source: #Our friends using the runtime
vi: #Các bạn của chúng tôi cũng dùng bộ runtime

source: | Language | Description | | ------------- |-------------| | <div class="img-icon">[![Microsoft PXT](resources/logos/pxt.svg)](https://codethemicrobit.com/)</div> | The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript. The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environment, Visual Studio Code. | | <div class="img-icon">[![Microsoft Touch Develop](resources/logos/touchdevelop.png)](https://www.microbit.co.uk/create-code) </div> | With its touch-based interface, Touch Develop has been designed for mobile devices with touchscreens. It can also be used with a pc, keyboard and mouse. Touch Develop introduces a statically-typed scripting language with syntax-directed editor. It can be used to produce web-based apps that can run online on any platform. | | <div class="img-icon">[![Microsoft Block Editor](resources/logos/blocks.png)](https://www.microbit.co.uk/create-code)</div> | The Block Editor is a visual editor and provides an introduction to structured programming via drag and drop coding blocks that snap together. You can also convert a Block Editor script into a Touch Develop script which helps with the transition to text-based programming. | | <div class="img-icon">[![Code Kingdoms JavaScript](resources/logos/codekingdoms.png)](https://www.microbit.co.uk/create-code)</div> | Code Kingdoms is a visual JavaScript editor. It has a drag-and-drop interface making it accessible to beginners. You can also change from the visual editor to a text-based editor which supports the transition to text-based programming as the learner’s coding skills progress. | | <div class="img-icon">[![MicroPython](resources/logos/python.png)](https://www.microbit.co.uk/create-code)</div> | MicroPython is a completely text-based editor, perfect for those who want to push their coding skills further. A selection of 'snippets' are on hand to help auto-complete trickier tasks and a range of premade images and music are built-in to give you a helping hand with your code. |
vi: | Ngôn ngữ lập trình | Mô tả | | ------------- |-------------| | <div class="img-icon">[![Microsoft PXT](resources/logos/pxt.svg)](https://codethemicrobit.com/)</div> | Bộ Microsoft Programming Experience Toolkit (PXT) cung cấp một trải nghiệm lập trình dựa trên JavaScript. Trải nghiệm này có đủ cấp độ được xây dựng sẵn, từ bộ soạn thảo đơn giản dựa theo các khối, đến trình soạn thảo bằng văn bản trong trình duyệt web với chức năng tự động hoàn thiện từ (auto-completion) và tự động sửa lỗi mạnh mẽ, cho đến hẳn một môi trường phát triển chuyên nghiệp, Visual Studio Code. | | <div class="img-icon">[![Microsoft Touch Develop](resources/logos/touchdevelop.png)](https://www.microbit.co.uk/create-code) </div> | Với giao diện chạm của nó, Touch Develop được thiết kế cho các thiết bị di động với màn hình chạm. Nó cũng có thể được dùng với một máy tính PC, bàn phím và con chuột. Touch Develop giới thiệu một ngôn ngữ kịch bản kiểu tĩnh với bộ soạn thảo hướng theo cú pháp (syntax-directed). Nó có thể được dùng để tạo ra các apps trên web có thể chạy trên bất cứ nền tảng nào. | | <div class="img-icon">[![Microsoft Block Editor](resources/logos/blocks.png)](https://www.microbit.co.uk/create-code)</div> | Chương trình Block Editor là một trình soạn thảo bằng đồ họa và thích hợp để giới thiệu về lập trình cấu trúc bằng các khối lệnh kéo thả có thể tự bám (snap) vào nhau. Bạn cũng có thể chuyển đổi một kịch bản Block Editor sang một đoạn mã Touch Develop để giúp chuyển tiếp sang kiểu lập trình bằng văn bản. | | <div class="img-icon">[![Code Kingdoms JavaScript](resources/logos/codekingdoms.png)](https://www.microbit.co.uk/create-code)</div> | Code Kingdoms là một bộ soạn thảo đồ họa JavaScript. Nó có giao diện kéo thả nên dễ học đối với người mới bắt đầu. Bạn cũng có thể thay đổi từ trình soạn thảo đồ họa sang một trình soạn thảo dùng văn bản để giúp việc chuyển tiếp sang lập trình bằng văn bản khi kỹ năng lập trình của người học tiến bộ lên. | | <div class="img-icon">[![MicroPython](resources/logos/python.png)](https://www.microbit.co.uk/create-code)</div> | MicroPython là một bộ soạn thảo hoàn toàn bằng văn bản, perfect cho ai muốn đẩy kỹ năng lập trình của họ tiến xa thêm. Một bộ 'snippets' chọn lọc được cung cấp để giúp việc điền đầy đủ lệnh (auto-complete) cho các tác vụ khó hơn, và một kho các hình ảnh và âm nhạc được tạo sẵn để giúp bạn trong khi lập trình. |

source: ARM mbed has an online IDE for C/C++ development available at [http://developer.mbed.org](http://developer.mbed.org). It is free to use and the BBC micro:bit is one of its officially supported platforms.
vi: ARM mbed có một môi trường phát triển tích hợp (IDE) online để phát triển code với C/C++ tại địa chỉ [http://developer.mbed.org](http://developer.mbed.org). Nó cho phép dùng miễn phí và bo BBC micro:bit là một trong các nền tảng được hỗ trợ chính thức.

source: The online IDE provides a simple interface for writing, compiling and sharing projects like the micro:bit DAL, which is based on the [mbed SDK](https://github.com/mbedmicro/mbed).
vi: Trình online IDE này cung cấp một giao diện đơn giản để viết, biên dịch và chia sẻ các dự án kiểu như micro:bit DAL, dựa trên bộ phát triển [mbed SDK](https://github.com/mbedmicro/mbed).

source: ![mbed.org online compiler screenshot](resources/mbed-compiler.png)
vi: ![ảnh màn hình bộ biên dịch online mbed.org](resources/mbed-compiler.png)

source: ### Getting started with mbed.org
vi: ### Bắt đầu với mbed.org

source: ## Hello World on mbed.org
vi: ## Hello World trên mbed.org

source: 1. Create an account on [developer.mbed.org](https://developer.mbed.org/account/signup).
vi: 1. Tạo một tài khoản trên trang [developer.mbed.org](https://developer.mbed.org/account/signup).

source: 1. Visit the [micro:bit platform page](https://developer.mbed.org/platforms/Microbit/) and *add the micro:bit to your compiler* by clicking the "Add to your mbed compiler" button in the right hand sidebar.
vi: 1. Vào trang [nền tảng micro:bit](https://developer.mbed.org/platforms/Microbit/) và *thêm bo mạch micro:bit vào trình biên dịch của bạn* bằng cách click vào nút "Add to your mbed compiler" ở thanh công cụ bên tay phải.

source: 1. Go to the [microbit-samples](https://developer.mbed.org/teams/Lancaster-University/code/microbit-samples/?platform=Microbit) project, and click the `Import this program` button for that project. The online IDE will open.
vi: 1. Đến trang của dự án [microbit-samples](https://developer.mbed.org/teams/Lancaster-University/code/microbit-samples/?platform=Microbit), và click vào nút `Import this program` cho dự án đó. Môi trường phát triển online IDE sẽ mở ra.

source: 1. Complete the import of the project and then select it in the sidebar and click the `Compile` button. The build will start. The first build will take longer than subsequent builds.
vi: 1. Hoàn tất việc nhập vào dự án, rồi chọn nó ở thanh công cụ bên cạnh và click vào nút `Compile`. Việc biên dịch chương trình sẽ bắt đầu. Lần biên dịch đầu tiên sẽ tốn nhiều thời gian hơn những lần tiếp theo.

source: 1. Your browser will prompt you to download a file. Save this file locally, then drag and drop it onto your micro:bit. The copy triggers the orange LED on the back of the micro:bit to flash; it will stop flashing when the download is complete.
vi: 1. Trình duyệt web của bạn sẽ hỏi bạn để tải về một tập tin. Lưu tập tin này vào máy tính của bạn, rồi kéo thả nó vào thư mục của bo mạch micro:bit. Quá trình sao chép sẽ làm cho đèn LED màu cam ở mặt sau micro:bit nhấp nháy; nó sẽ ngưng nháy khi chương trình đã được tải xuống bo mạch thành công.

source: 1. When the copy process finishes, the micro:bit drive will reset and disconnect from your computer. At this point, your code will also start running!
vi: 1. Khi việc sao chép kết thúc, ổ đĩa micro:bit sẽ khởi động lại và ngắt kết nối khỏi máy tính của bạn. Vào thời điểm này, chương trình của bạn bắt đầu chạy!

source: There is a more detailed guide for using the micro:bit in mbed on the [Lancaster-University team wiki on mbed](https://developer.mbed.org/teams/Lancaster-University/wiki/MicrobitGettingStarted)
vi: Có một hướng dẫn cụ thể hơn để sử dụng micro:bit trong mbed trên trang [wiki về mbed của Đại học Lancaster](https://developer.mbed.org/teams/Lancaster-University/wiki/MicrobitGettingStarted).
